Embedfire-stm32f429-tiaozhanzhe/ebf_stm32f429_tiaozhanzhe_std_code/刷外部FLASH程序（如何恢复出厂内容）/USER/aux_data.h
#ifndef __AUX_DATA_H
#define	__AUX_DATA_H

#include "stm32f4xx.h"

typedef enum 
{
    UPDATE,
    DO_NOT_UPDATE
}Burn_Option_Typedef;

typedef struct
{
  const char*               filename;      //从SD卡拷录数据时的文件路径
  const char*               description;   //描述
  uint32_t                  start_addr;    //开始地址
  uint32_t                  length;        //长度
  Burn_Option_Typedef     burn_option;   
  
}Aux_Data_Typedef;

typedef enum 
{
    AUX_DATA_ERROR = -1,
  
    AUX_XBF_XINSONGTI_25, 
    AUX_XBF_XINSONGTI_19, 
    AUX_UNIGBK, 
    AUX_WIFI_FW,
    AUX_WIFI_PARA1,
    AUX_WIFI_PARA2,
    AUX_GB2312_H2424,  
    AUX_FILE_SYSTEM,      //FLASH文件系统
  
    AUX_MAX_NUM,
} aux_data_t; 

extern  Aux_Data_Typedef  burn_data[AUX_MAX_NUM];


/*信息输出*/
#define BURN_DEBUG_ON         1
#define BURN_DEBUG_FUNC_ON    0

#define BURN_INFO(fmt,arg...)           printf("<<-BURN-INFO->> "fmt"\n",##arg)
#define BURN_ERROR(fmt,arg...)          printf("<<-BURN-ERROR->> "fmt"\n",##arg)
#define BURN_DEBUG(fmt,arg...)          do{\
                                          if(BURN_DEBUG_ON)\
                                          printf("<<-BURN-DEBUG->> [%d]"fmt"\n",__LINE__, ##arg);\
                                          }while(0)

#define BURN_DEBUG_FUNC()               do{\
                                         if(BURN_DEBUG_FUNC_ON)\
                                         printf("<<-BURN-FUNC->> Func:%s@Line:%d\n",__func__,__LINE__);\
                                       }while(0)

int burn_file_sd2flash(Aux_Data_Typedef *dat,uint8_t file_num);


#endif /* __BURN_DATA_H */
